app/views/comments/_comment.html.erb

  <% if comment.user == current_user %>
    <%= link_to post_comment_path(post, comment), method: :delete, data: {post_id: post.id, value: post.comments.count, confirm: "Are you sure?" }, remote: true, id: "delete-#{comment.id}", class: "delete-comment" do %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at ASC  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]