app/views/comments/_comment.html.erb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sdasd"], ["post_id", 2], ["user_id", 2], ["created_at", "2016-12-24 04:11:24.007276"], ["updated_at", "2016-12-24 04:11:24.007276"]]
---
  <div class="comment-content">
    <%= comment.content %>  <span style="color:#CCC"> | <%= time_ago_in_words comment.created_at %> ago</span>