app/views/posts/_post.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT 1  [["post_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
      <div class="comments" id="comments_<%= post.id %>">
        <% if post.comments.any? %>

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY "comments"."id" DESC LIMIT 4  [["post_id", 2]]
---
          </div>
          <%= render post.comments.last(4), post: post %>