app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at ASC  [["post_id", 2]]
---
  def index
    @comments = @post.comments.order("created_at ASC")

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sdasd"], ["post_id", 2], ["user_id", 2], ["created_at", "2016-12-24 04:11:24.007276"], ["updated_at", "2016-12-24 04:11:24.007276"]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = @post.comments.find(params[:id])
    if @comment.user_id == current_user.id
      @comment.delete