app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC').page params[:page]
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = current_user.posts.build(post_params)
    #creating the post and saving it into the database
    if @post.save
---
INSERT INTO "posts" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)