app/controllers/profiles_controller.rb

UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "Trying out some Ruby and HTML/CSS to make this Instagram clone :) for fun. "], ["updated_at", "2017-01-06 05:44:38.251864"], ["id", 2]]
---
  def update
    if @user.update(profile_params)

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "shawnrl"]]
---
  def set_user
    @user = User.find_by(user_name: params[:user_name])